E-AluminumHeat-CHT/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// E-shaped aluminum heatsink, fins pointing UP (CHT case).
//
// Domain (x-y plane):
//   x : [-0.5, 0.6]  total 1100 mm  (left 500mm | heatsink 100mm | right 500mm)
//   y : [0, 0.50]    total 500 mm   (heatsink 100mm | air above 400mm)
//
// Heat source: 3mm hotspot centered at x=0.05
//   x=[0.0485, 0.0515] → base_hotspot patch
//   rest of base       → base_adiabatic patch
//
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    // z=0 plane (indices 0-23) — original heatsink
    // row 0  y=0.00
    (0      0      0)   //  0
    (0.02   0      0)   //  1
    (0.04   0      0)   //  2
    (0.06   0      0)   //  3
    (0.08   0      0)   //  4
    (0.10   0      0)   //  5

    // row 1  y=0.02
    (0      0.02   0)   //  6
    (0.02   0.02   0)   //  7
    (0.04   0.02   0)   //  8
    (0.06   0.02   0)   //  9
    (0.08   0.02   0)   // 10
    (0.10   0.02   0)   // 11

    // row 2  y=0.10
    (0      0.10   0)   // 12
    (0.02   0.10   0)   // 13
    (0.04   0.10   0)   // 14
    (0.06   0.10   0)   // 15
    (0.08   0.10   0)   // 16
    (0.10   0.10   0)   // 17

    // row 3  y=0.50  (expanded from 0.20)
    (0      0.50   0)   // 18
    (0.02   0.50   0)   // 19
    (0.04   0.50   0)   // 20
    (0.06   0.50   0)   // 21
    (0.08   0.50   0)   // 22
    (0.10   0.50   0)   // 23

    // z=0.02 plane (indices 24-47) — original heatsink
    (0      0      0.02) // 24
    (0.02   0      0.02) // 25
    (0.04   0      0.02) // 26
    (0.06   0      0.02) // 27
    (0.08   0      0.02) // 28
    (0.10   0      0.02) // 29

    (0      0.02   0.02) // 30
    (0.02   0.02   0.02) // 31
    (0.04   0.02   0.02) // 32
    (0.06   0.02   0.02) // 33
    (0.08   0.02   0.02) // 34
    (0.10   0.02   0.02) // 35

    (0      0.10   0.02) // 36
    (0.02   0.10   0.02) // 37
    (0.04   0.10   0.02) // 38
    (0.06   0.10   0.02) // 39
    (0.08   0.10   0.02) // 40
    (0.10   0.10   0.02) // 41

    (0      0.50   0.02) // 42
    (0.02   0.50   0.02) // 43
    (0.04   0.50   0.02) // 44
    (0.06   0.50   0.02) // 45
    (0.08   0.50   0.02) // 46
    (0.10   0.50   0.02) // 47

    // z=0 plane — hotspot vertices at x=0.0485 and x=0.0515
    (0.0485 0      0)   // 48
    (0.0485 0.02   0)   // 49
    (0.0485 0.10   0)   // 50
    (0.0485 0.50   0)   // 51  (y expanded)
    (0.0515 0      0)   // 52
    (0.0515 0.02   0)   // 53
    (0.0515 0.10   0)   // 54
    (0.0515 0.50   0)   // 55  (y expanded)

    // z=0.02 plane — hotspot vertices
    (0.0485 0      0.02) // 56
    (0.0485 0.02   0.02) // 57
    (0.0485 0.10   0.02) // 58
    (0.0485 0.50   0.02) // 59  (y expanded)
    (0.0515 0      0.02) // 60
    (0.0515 0.02   0.02) // 61
    (0.0515 0.10   0.02) // 62
    (0.0515 0.50   0.02) // 63  (y expanded)

    // left air side column  x=-0.5  (expanded from -0.1)
    (-0.5   0      0)   // 64
    (-0.5   0.02   0)   // 65
    (-0.5   0.10   0)   // 66
    (-0.5   0.50   0)   // 67  (x and y expanded)
    // right air side column  x=0.6  (expanded from 0.2)
    (0.6    0      0)   // 68
    (0.6    0.02   0)   // 69
    (0.6    0.10   0)   // 70
    (0.6    0.50   0)   // 71  (x and y expanded)
    // left  x=-0.5, z=0.02
    (-0.5   0      0.02) // 72
    (-0.5   0.02   0.02) // 73
    (-0.5   0.10   0.02) // 74
    (-0.5   0.50   0.02) // 75  (x and y expanded)
    // right x=0.6,  z=0.02
    (0.6    0      0.02) // 76
    (0.6    0.02   0.02) // 77
    (0.6    0.10   0.02) // 78
    (0.6    0.50   0.02) // 79  (x and y expanded)
);

blocks
(
    // ---- Row 0: backbone y=[0,0.02] ----
    hex (0  1  7  6   24 25 31 30)  (4 4 1)  simpleGrading (1 1 1)
    hex (1  2  8  7   25 26 32 31)  (4 4 1)  simpleGrading (1 1 1)
    // Block 2a: x=[0.04,0.0485]
    hex (2  48 49 8   26 56 57 32)  (3 4 1)  simpleGrading (1 1 1)
    // Block 2b: x=[0.0485,0.0515]  3mm HOTSPOT
    hex (48 52 53 49  56 60 61 57)  (3 4 1)  simpleGrading (1 1 1)
    // Block 2c: x=[0.0515,0.06]
    hex (52 3  9  53  60 27 33 61)  (3 4 1)  simpleGrading (1 1 1)
    hex (3  4  10 9   27 28 34 33)  (4 4 1)  simpleGrading (1 1 1)
    hex (4  5  11 10  28 29 35 34)  (4 4 1)  simpleGrading (1 1 1)

    // ---- Row 1: fins & gaps y=[0.02,0.10] ----
    hex (6  7  13 12  30 31 37 36)  (4 16 1) simpleGrading (1 1 1)
    hex (7  8  14 13  31 32 38 37)  (4 16 1) simpleGrading (1 1 1)
    hex (8  49 50 14  32 57 58 38)  (3 16 1) simpleGrading (1 1 1)
    hex (49 53 54 50  57 61 62 58)  (3 16 1) simpleGrading (1 1 1)
    hex (53 9  15 54  61 33 39 62)  (3 16 1) simpleGrading (1 1 1)
    hex (9  10 16 15  33 34 40 39)  (4 16 1) simpleGrading (1 1 1)
    hex (10 11 17 16  34 35 41 40)  (4 16 1) simpleGrading (1 1 1)

    // ---- Row 2: air above y=[0.10,0.50]  400mm → 20 cells ----
    hex (12 13 19 18  36 37 43 42)  (4 20 1) simpleGrading (1 1 1)
    hex (13 14 20 19  37 38 44 43)  (4 20 1) simpleGrading (1 1 1)
    hex (14 50 51 20  38 58 59 44)  (3 20 1) simpleGrading (1 1 1)
    hex (50 54 55 51  58 62 63 59)  (3 20 1) simpleGrading (1 1 1)
    hex (54 15 21 55  62 39 45 63)  (3 20 1) simpleGrading (1 1 1)
    hex (15 16 22 21  39 40 46 45)  (4 20 1) simpleGrading (1 1 1)
    hex (16 17 23 22  40 41 47 46)  (4 20 1) simpleGrading (1 1 1)

    // ---- Left air side column x=[-0.5, 0]  500mm → 20 cells ----
    hex (64 0  6  65  72 24 30 73)  (20 4  1) simpleGrading (1 1 1)
    hex (65 6  12 66  73 30 36 74)  (20 16 1) simpleGrading (1 1 1)
    hex (66 12 18 67  74 36 42 75)  (20 20 1) simpleGrading (1 1 1)

    // ---- Right air side column x=[0.1, 0.6]  500mm → 20 cells ----
    hex (5  68 69 11  29 76 77 35)  (20 4  1) simpleGrading (1 1 1)
    hex (11 69 70 17  35 77 78 41)  (20 16 1) simpleGrading (1 1 1)
    hex (17 70 71 23  41 78 79 47)  (20 20 1) simpleGrading (1 1 1)
);

boundary
(
    base_hotspot
    {
        type patch;
        faces
        (
            (48 52 60 56)
        );
    }

    base_adiabatic
    {
        type patch;
        faces
        (
            (0  1  25 24)
            (1  2  26 25)
            (2  48 56 26)
            (52 3  27 60)
            (3  4  28 27)
            (4  5  29 28)
        );
    }

    left_open
    {
        type patch;
        faces
        (
            (64 65 73 72)
            (65 66 74 73)
            (66 67 75 74)
        );
    }

    right_open
    {
        type patch;
        faces
        (
            (68 69 77 76)
            (69 70 78 77)
            (70 71 79 78)
        );
    }

    base_side
    {
        type patch;
        faces
        (
            (64  0  24 72)
            (5  68  76 29)
        );
    }

    top
    {
        // y=0.50 open boundary
        type patch;
        faces
        (
            (67 75 42 18)   // left col top
            (18 42 43 19)
            (19 43 44 20)
            (20 44 59 51)
            (51 59 63 55)
            (55 63 45 21)
            (21 45 46 22)
            (22 46 47 23)
            (23 47 79 71)   // right col top
        );
    }

    front
    {
        type empty;
        faces
        (
            (64 65  6   0)
            (65 66 12   6)
            (66 67 18  12)
            (0   6   7   1)
            (1   7   8   2)
            (2   8  49  48)
            (48 49  53  52)
            (52 53   9   3)
            (3   9  10   4)
            (4  10  11   5)
            (6  12  13   7)
            (7  13  14   8)
            (8  14  50  49)
            (49 50  54  53)
            (53 54  15   9)
            (9  15  16  10)
            (10 16  17  11)
            (12 18  19  13)
            (13 19  20  14)
            (14 20  51  50)
            (50 51  55  54)
            (54 55  21  15)
            (15 21  22  16)
            (16 22  23  17)
            (5  11  69  68)
            (11 17  70  69)
            (17 23  71  70)
        );
    }

    back
    {
        type empty;
        faces
        (
            (72 24 30 73)
            (73 30 36 74)
            (74 36 42 75)
            (24 25 31 30)
            (25 26 32 31)
            (26 56 57 32)
            (56 60 61 57)
            (60 27 33 61)
            (27 28 34 33)
            (28 29 35 34)
            (30 31 37 36)
            (31 32 38 37)
            (32 57 58 38)
            (57 61 62 58)
            (61 33 39 62)
            (33 34 40 39)
            (34 35 41 40)
            (36 37 43 42)
            (37 38 44 43)
            (38 58 59 44)
            (58 62 63 59)
            (62 39 45 63)
            (39 40 46 45)
            (40 41 47 46)
            (29 76 77 35)
            (35 77 78 41)
            (41 78 79 47)
        );
    }
);

// ************************************************************************* //
