E-AluminumHeat-CHT/case/0.orig/air/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        // Open top: velocity driven by pressure gradient
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    left_open
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    right_open
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    base_side
    {
        type            noSlip;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    // All walls (fin surfaces, backbone top, gap walls)
    ".*_to_aluminum"
    {
        type            noSlip;
    }
}

// ************************************************************************* //
