E-AluminumHeat-CHT/case/0.orig/aluminum/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/aluminum";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Dummy pressure for solid region (not solved, required by heSolidThermo)

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    base_hotspot
    {
        type            calculated;
        value           uniform 101325;
    }
    base_adiabatic
    {
        type            calculated;
        value           uniform 101325;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    ".*_to_air"
    {
        type            calculated;
        value           uniform 101325;
    }
}

// ************************************************************************* //
