E-AluminumHeat-CHT/case/0.orig/air/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    top
    {
        // Open boundary: air enters at ambient, exits freely
        type            inletOutlet;
        inletValue      uniform 293.15;
        value           uniform 293.15;
    }

    left_open
    {
        type            inletOutlet;
        inletValue      uniform 293.15;
        value           uniform 293.15;
    }

    right_open
    {
        type            inletOutlet;
        inletValue      uniform 293.15;
        value           uniform 293.15;
    }

    base_side
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    // Coupled interface to aluminum region
    ".*_to_aluminum"
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        value           uniform 293.15;
    }
}

// ************************************************************************* //
