E-AluminumHeat-CHT/case/0.orig/air/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// Turbulent thermal diffusivity — zero for laminar flow

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            calculated;
        value           uniform 0;
    }

    left_open
    {
        type            calculated;
        value           uniform 0;
    }

    right_open
    {
        type            calculated;
        value           uniform 0;
    }

    base_side
    {
        type            calculated;
        value           uniform 0;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    ".*_to_aluminum"
    {
        type            calculated;
        value           uniform 0;
    }
}

// ************************************************************************* //
